#+TODO: TODO(t) IN-PROGRESS(i) | DONE(d)
#+OPTIONS: toc:nil
#+Latex_header: \usepackage{setspace}
#+latex_header: \doublespacing
#+latex_header: \usepackage[citestyle=authoryear,bibstyle=authortitle,hyperref=true,backref=true,maxcitenames=3,uniquename=false,maxbibnames=99,url=true,backend=biber,natbib=true] {biblatex}
#+latex_header: \usepackage[margin=1in]{geometry}
#+latex_header: \usepackage{array}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{amssymb}
#+latex_header: \usepackage{amsthm}
#+latex_header: \newtheorem{assumption}{Assumption}
#+latex_header: \newtheorem{proposition}{Proposition}
#+latex_header: \newtheorem{definition}{Definition}
# Hack for square brackets
#+latex_header: \newcolumntype{C}[1]{>{\centering\arraybackslash}p{#1}}
#+latex_header: %\ExecuteBibliographyOptions{parentracker=false}

#+latex_header: \makeatletter

#+latex_header: \newrobustcmd*{\parentexttrack}[1]{%
  #+latex_header: \begingroup
  #+latex_header: \blx@blxinit
  #+latex_header: \blx@setsfcodes
  #+latex_header: \blx@bibopenparen#1\blx@bibcloseparen
  #+latex_header: \endgroup}

#+latex_header: \AtEveryCite{%
  #+latex_header: \let\parentext=\parentexttrack%
  #+latex_header: \let\bibopenparen=\bibopenbracket%
  #+latex_header: \let\bibcloseparen=\bibclosebracket}

#+latex_header: \makeatother
#+latex_header: \addbibresource{/home/matt/Dropbox/BibLaTeX/library.bib}

# # Start document
# #+title: Sympathy for the Noise Trader
# #+author: Matthew D. DeAngelis
\begin{titlepage}
\singlespacing
\begin{center}
\LARGE Sympathy for the Noise Trader: Limitations to Learning from Price
\vspace*{35mm}

\normalsize Matthew D. DeAngelis\textsuperscript{a}

\textit{Georgia State University}
\end{center}

\vspace*{\fill}
\textsuperscript{a} Corresponding author. School of Accountancy, J. Mack Robinson College of Business, Georgia State University, 35 Broad Street, Room 512, Atlanta GA, 30302. Phone: (404) 413-7214. E-mail: mdeangelis@gsu.edu

\vspace*{10mm}
* Results
  I first present results when price reflects a single valuation parameter as in GS. The following code generates a single market with a single parameter and iterates trading until the price converges:

\singlespacing

#+BEGIN_SRC clojure :results value silent

  (def m1 (first (iterate-markets 1 1)))
  (price-plot m1)

#+END_SRC
\doublespacing

Note that market parameters are random, so subsequent runs of the same code will result in different market evolutions. Nonetheless, the convergence results for this market, presented in Figure [[fig:1-param-price]], are representative of a standard evolution.

#+BEGIN_CENTER
[Figure [[fig:1-param-price]] here]
#+END_CENTER

Informed investors are displayed in orange. Their prior is fixed at the true value $V = \theta_1$. Consistent with GS, the uninformed investors observe price movements and update their prior over time so that both uninformed investors and price converge to the correct value. This market converged in slightly over 120 trading rounds, which is more than usual for my simulation; on average it takes about 87 rounds. Note that the rate of convergence is likely to be slower than what one would observe in practice, since I only allow a maximum price adjustment of $\delta = 0.01$ per trading round.

Importantly, in the single-parameter case the system is exactly identified: there is one unknown ($\theta_1$) and one signal ($p$). Price convergence to $V$ implies convergence of the parameter estimate to $\theta_1$, as Proposition \ref{prop:nonid} predicts.

I now extend the above simulation to incorporate multiple parameters. The following code generates a market with a two-parameter security vector ($n = 2$) and investors with two-parameter priors and iterates trading until the price converges:

\singlespacing
#+BEGIN_SRC clojure :results value silent

  (def m2 (first (iterate-markets 2 1)))
  (price-plot m2)

#+END_SRC
\doublespacing

Figure [[fig:2-param-price]] shows the convergence results.

#+BEGIN_CENTER
[Figure [[fig:2-param-price]] here]
#+END_CENTER

In keeping with GS, price again converges on the correct value $V = \theta_1 + \theta_2$ and uninformed investors correctly update their aggregate priors to agree with informed investors on the correct price. As a result, the market does indeed price all available information about the security.

This is, however, a distinctly different statement from investors and the market having priced each individual parameter. The following code plots the prior of each investor as the price converges. The x-axis shows the value for $\theta_1$ and the y-axis the value for $\theta_2$.

\singlespacing
#+BEGIN_SRC clojure :results value silent
  ;; The vector argument indicates the progress to convergence.
  ;; So 0 indicates the first round, 1 the final round.
  ;; 0.2 indicates 20% of the way to the final round.
  ;; The final numeric parameter designates the number of columns
  ;; for the combined plot.
  (plot-snap m2 [0 0.2 0.4 0.6 0.8 1] 3)

#+END_SRC
\doublespacing

Figure [[fig:2-param-investors]] shows the results. Uninformed investors start with diffuse priors and undergo steady convergence, as before. However, uninformed investors converge only on the /sum/ of their prior, producing a fitted line that passes through the true aggregate value but maintaining diffusion on the individual parameters. This is precisely the $(n-1)$-dimensional hyperplane $\mathcal{S}(p)$ described in Proposition \ref{prop:nonid}: in two dimensions, it is a line $\hat{\theta}_1 + \hat{\theta}_2 = V$. Since price only communicates the sum of the parameters, any prior that produces that sum is perceived as equally valid by an uninformed investor.

#+BEGIN_CENTER
[Figure [[fig:2-param-investors]] here]
#+END_CENTER

As in citet:verrecchiaConsensusBeliefsInformation1980, investors do not have to agree on parameter values. The market could still be said to have a correct consensus view of each parameter if, in the course of their updating, investors reach the correct average values. The two-parameter value of the security in this market is:
#+BEGIN_SRC clojure :results value :exports results :eval never-export
(:security (last m2))
#+END_SRC

#+RESULTS:
| 0.26 | -0.2 |

The following function calculates the average of investors' estimates for each parameter in the valuation vector:

\singlespacing
#+BEGIN_SRC clojure :results output silent

  (defn avg-prior
    [m]
    (map (fn [n] (/ (reduce + (map #(get-in % [:prior n :value]) (:investors m)))
                    (count (:investors m))))
         (range (count (:security m)))))

#+END_SRC
\doublespacing

The average two-parameter prior across all investors is:
#+BEGIN_SRC clojure :results value :exports results :eval never-export

  (avg-prior (last m2))

#+END_SRC

#+RESULTS:
| 0.1893936029394628 | -0.12848297427298758 |

So the average error for each of the two parameters is:
#+BEGIN_SRC clojure :results value :exports results :eval never-export

(map #(- %1 %2) (:security (last m2)) (avg-prior (last m2)))

#+END_SRC

#+RESULTS:
| 0.0706063970605372 | -0.07151702572701243 |

The total summed error is roughly zero, consistent with market convergence on an efficient price, but the errors on individual parameters are not zero. Note that the errors are approximately equal in magnitude but opposite in sign: the overestimation of $\theta_1$ is compensated by an underestimation of $\theta_2$. This is a direct consequence of the identification constraint --- any parameter vector on the hyperplane $\hat{\theta}_1 + \hat{\theta}_2 = V$ produces the correct aggregate price, so errors in individual parameters must net to zero. As such, although price serves as an aggregator for imperfect individual information sets, the aggregate of investors' beliefs does not reflect the true value of the individual parameters. The market cannot be said to have correctly priced individual parameters of the valuation vector.

Next I examine whether the error in valuing parameters increases as the number of parameters increases above two. I vary the number of parameters between two and 10 and create a sample of 500 markets for each value. As above, I average priors across all investors to get the market's consensus estimate of each parameter. Then, I calculate the sum of squared errors for the parameter vector, scaled by the number of parameters, for each market, and average this error across the sample of 500 markets:

\begin{equation}
\text{MSE}(n) = \frac{1}{500} \sum_{m=1}^{500} \frac{1}{n} \sum_{i=1}^{n} \left(\theta_i^m - \bar{\hat{\theta}}_i^m \right)^2
\end{equation}

where $\theta_i^m$ is the true value of parameter $i$ in market $m$ and $\bar{\hat{\theta}}_i^m$ is the average estimate across all investors.

\singlespacing
#+NAME: mean-error
#+BEGIN_SRC clojure :results value table :eval never-export

  (defn sse-avg
    [m]
    (/ (reduce + (map #(* (- %1 %2) (- %1 %2))
                      (:security m) (avg-prior m)))
       (count (:security m))))
  (def sse-avg-by-size (mapv (fn [s]
                              (map sse-avg
                                   (map last (iterate-markets s 500))))
                            (rest (map inc (range 10)))))

  (vec (conj (map #(vector %1 %2 %3 %4)
                  (vec (rest (mapv inc (range 10))))
                  (mapv (comp #(round2 3 %) average) sse-avg-by-size)
                  (vec
                   (conj
                    (map #(round2 3 (:t-stat
                                   (stats/t-test
                                    (get sse-avg-by-size (- % 2))
                                    :y (get sse-avg-by-size 0))))
                         [3 4 5 6 7 8 9 10]) ""))
                  (vec (conj
                        (map #(round2 3 (:t-stat
                                         (stats/t-test
                                          (get sse-avg-by-size (- % 2))
                                          :y (get sse-avg-by-size (- % 3)))))
                             [3 4 5 6 7 8 9 10]) "")))
             ["Market Size"
              "Mean SSE"
              "t-stat - test of difference with market size 2"
              "t-stat - test of difference with market size n-1"]))

#+END_SRC
\doublespacing

As shown in Table [[tbl:sse-errors]], the sum of squared errors across parameters increases with the number of parameters. The increase is, however, nonlinear, increasing most dramatically when moving from two to three parameters. However, increasing the number of parameters above two always results in a statistically higher error compared to the two-parameter case, suggesting that increasing the number of parameters increases the mispricing of individual parameters. This is consistent with Proposition \ref{prop:nonid}: as $n$ grows, the hyperplane $\mathcal{S}(p)$ gains dimensions, and the space of parameter vectors consistent with the observed price expands.

#+BEGIN_CENTER
[Table [[tbl:sse-errors]] here]
#+END_CENTER

